var bridgeFormatTxt = '''模板与示例
（示例纯属虚构，如有雷同纯属巧合）

【个人信息】
性别：女
出身年份：1993年
籍贯：重庆
身高：160
体重：胖（可只进行文字描述）
学历及毕业院校：本硕UESTC
居住地：成都
工作：某国企
年薪：8-12w
车房：暂时无车无房，计划买套小的
未来规划：努力奋斗提升自己成为更优秀的人
感情史：1段
家庭成员：独生子女，父母感情好且身体健康
家庭经济：父母爷爷奶奶外公外婆均有社保、自己的房子(在老家)
兴趣爱好：听歌、看剧、看书等
自我描述：相信爱情、相信缘分，活泼开朗，可以话很多可以很安静

【对另一半要求】
年龄：最好比我大，不过也看缘分
籍贯：不限
身高：170以上
体重：不要有肚子（可只进行文字描述）
学历：本科及以上
居住地：成都
工作：正经工作，最好不要秃顶
薪资范围：12w以上
车房：要有买房付首付的能力，车子无所谓，也可共同买房
未来规划：希望你有自己的追求
感情史：不限
家庭成员：都行
家庭经济：父母要有自己养老的能力
兴趣爱好：喜欢运动最好了，会点乐器就更棒
对ta的期待：希望你是个有责任心的人，可以跟我有共同话题

照片：''';
